---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.GetEnumerator
source: html/59778d59-b3e4-20a1-9fdf-a200cb80c68d.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.